packages/stripe-adapter/test/mock_replies.json

[
  {
    "url": "/v1/webhook_endpoints",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "we_1IcrkHHipyrr1EYiSGhlscV7",
          "object": "webhook_endpoint",
          "api_version": null,
          "application": null,
          "created": 1617626493,
          "description": null,
          "enabled_events": ["invoice.finalization_failed", "account.updated"],
          "livemode": false,
          "metadata": {},
          "status": "enabled",
          "url": "https://exmp.url.com"
        }
      ],
      "has_more": false,
      "url": "/v1/webhook_endpoints"
    }
  },
  {
    "url": "/v1/products",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "prod_JMpOpTpdX5rDKx",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1619348585,
          "description": null,
          "images": [],
          "livemode": false,
          "metadata": {},
          "name": "sfdsfsf",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1633953462,
          "url": null
        },
        {
          "id": "prod_JMpOpTpdX5rDKx",
          "object": "product",
          "active": true,
          "attributes": [],
          "created": 1619348585,
          "description": null,
          "images": [],
          "livemode": false,
          "metadata": {},
          "name": "abc",
          "package_dimensions": null,
          "shippable": null,
          "statement_descriptor": null,
          "tax_code": null,
          "type": "service",
          "unit_label": null,
          "updated": 1633953462,
          "url": null
        }
      ],
      "has_more": false,
      "url": "/v1/products"
    }
  },
  {
    "url": "/v1/tax_rates",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "txr_1Jwt1JHipyrr1EYi3coTN5Y9",
          "object": "tax_rate",
          "active": true,
          "country": "AL",
          "created": 1637174289,
          "description": null,
          "display_name": "Sales tax",
          "inclusive": false,
          "jurisdiction": null,
          "livemode": false,
          "metadata": {},
          "percentage": 3,
          "state": null,
          "tax_type": null
        }
      ],
      "has_more": false,
      "url": "/v1/tax_rates"
    }
  },
  {
    "url": "/v1/coupons",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "S8nceGxL",
          "object": "coupon",
          "amount_off": null,
          "created": 1621494807,
          "currency": null,
          "duration": "forever",
          "duration_in_months": null,
          "livemode": false,
          "max_redemptions": null,
          "metadata": {},
          "name": "testCoupon",
          "percent_off": 4,
          "redeem_by": null,
          "times_redeemed": 0,
          "valid": true
        }
      ],
      "has_more": false,
      "url": "/v1/coupons"
    }
  },
  {
    "url": "/v1/reporting/report_types",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "balance.summary.1",
          "object": "reporting.report_type",
          "data_available_end": 1638316800,
          "data_available_start": 1616536800,
          "default_columns": ["category", "description", "net_amount", "currency"],
          "livemode": false,
          "name": "Balance summary",
          "updated": 1638340021,
          "version": 1
        }
      ],
      "has_more": false,
      "url": "/v1/reporting/report_types"
    }
  },
  {
    "url": "/v1/prices?product=prod_JMpOpTpdX5rDKx",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "price_1JjN8THipyrr1EYirgGmnx9A",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1633953461,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_JMpOpTpdX5rDKx",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 600,
          "unit_amount_decimal": "600"
        },
        {
          "id": "price_1JjN8GHipyrr1EYi69M6nDJA",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1633953448,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_JMpOpTpdX5rDKx",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 700,
          "unit_amount_decimal": "700"
        },
        {
          "id": "price_1Ik5jyHipyrr1EYiTX75FImK",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1619348586,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_JMpOpTpdX5rDKx",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 600,
          "unit_amount_decimal": "600"
        },
        {
          "id": "price_1Ik5jyHipyrr1EYiZkn6nySi",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1619348586,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_JMpOpTpdX5rDKx",
          "recurring": null,
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "one_time",
          "unit_amount": 400,
          "unit_amount_decimal": "400"
        }
      ],
      "has_more": false,
      "url": "/v1/prices"
    }
  },
  {
    "url": "/v1/country_specs",
    "response": {
      "object": "list",
      "data": [
        {
          "id": "AR",
          "object": "country_spec",
          "default_currency": "ars",
          "supported_bank_account_currencies": {
            "ars": ["AR"]
          },
          "supported_payment_currencies": ["ars"],
          "supported_payment_methods": ["card", "stripe"],
          "supported_transfer_countries": [
            "AR",
            "AT",
            "AU",
            "BE",
            "BG",
            "BO",
            "CA",
            "CH",
            "CL",
            "CO",
            "CR",
            "CY",
            "CZ",
            "DE",
            "DK",
            "DO",
            "EE",
            "EG",
            "ES",
            "FI",
            "FR",
            "GB",
            "GR",
            "HK",
            "HR",
            "HU",
            "ID",
            "IE",
            "IL",
            "IS",
            "IT",
            "LI",
            "LT",
            "LU",
            "LV",
            "MT",
            "MX",
            "NL",
            "NO",
            "NZ",
            "PE",
            "PL",
            "PT",
            "PY",
            "RO",
            "SE",
            "SG",
            "SI",
            "SK",
            "TH",
            "TT",
            "UY",
            "US"
          ],
          "verification_fields": {
            "company": {
              "additional": [],
              "minimum": ["external_account", "tos_acceptance.date", "tos_acceptance.ip"]
            },
            "individual": {
              "additional": [],
              "minimum": ["external_account", "tos_acceptance.date", "tos_acceptance.ip"]
            }
          }
        }
      ],
      "has_more": true,
      "url": "/v1/country_specs"
    }
  }
]
